#include "Map.h"
#include "Order.h"
#include "Rail.h"
#include "Route.h"
#include "User.h"

#define PLACESNUM 53
#define WAYNUM 33

void CreateRailMap(Map& M);

void test(Map& M) {
	for (int i = 0; i < M.placeNum; i++) {
		for (int j = 0; j < M.placeNum; j++) {
			printf("%d ", M.ways[i][j]);
		}
		printf("\n");
	}

	/*for (int i = 0; i < M.placeNum; i++)
		printf("%s\n", M.places[i]);*/
}

int main() {
	Map M;
	CreateRailMap(M);
	test(M);

	/*scanf_s("%s", s, sizeof(String));
	gets_s(s, sizeof(String));*/
	/*char a, b;
	printf("input a:");
	scanf_s("%c", &a, 2);
	char a, b;
	printf("input a:");
	scanf_s("%c", &a, 2);
	while (getchar() != '\n') {
		while (getchar() != '\n') {
			getchar();
		}
		printf("请重新输入：");
		scanf_s("%c", &a, 2);
	}
	printf("%c\n", a);
	printf("input b:");
	scanf_s("%c", &b, 2);
	printf("%c\n", b);*/
	return 0;
}

void CreateRailMap(Map& M) {
	String places[PLACESNUM] = {
		// 京广
		"乐昌东", "韶关", "英德西", "清远", "广州北", "广州南",
		// 广深港
		/*"广州南",*/ "庆盛", "虎门", "光明城", "深圳北", "福田", "香港西九龙",
        // 贵广
		"怀集", "广宁", "肇庆东", "三水南", "佛山西", /*"广州南",*/
		// 南广
		"郁南", "南江口", "云浮东", /*"肇庆东",*/ /*"三水南",*/ /*"佛山西",*/ /*"广州南",*/
		// 杭深
		/*"深圳北",*/ "深圳坪山", "惠州南", "惠东", "鲘门", "汕尾", "陆丰", "葵潭", "普宁", "潮阳", "潮汕", "汕头", "饶平",
		// 梅汕
		"梅州西", "俞江北", "建桥", "丰顺东", "揭阳", "揭阳机场", /*"潮汕",*/
		// 江湛
		"湛江西", "吴川", "茂名", "电白", "马踏", "阳西", "阳江", "阳东", "恩平", "开平南", "台山", "双水镇", "新会" /*"广州南",*/

		"中山", "珠海"
	};

	WayInfo ways[WAYNUM] = {
		{"乐昌东", "韶关", 44},
		{"韶关", "英德西", 87},
		{"英德西", "清远", 57},
		{"清远", "广州北", 36},
		{"广州北", "广州南", 47},

		{"广州南", "庆盛", 31},
		{"庆盛", "虎门", 19},
		{"虎门", "光明城", 36},
		{"光明城", "深圳北", 16},
		{"深圳北", "福田", 9},
		{"福田", "香港西九龙", 30},

		{"怀集", "广宁", 100},
		{"广宁", "肇庆东", 44},
		{"肇庆东", "三水南", 44},
		{"三水南", "佛山西", 44},
		{"佛山西", "广州南", 44},

		{"郁南", "南江口", 39},
		{"南江口", "云浮东", 38},
		{"云浮东", "肇庆东", 62},
		{"肇庆东", "三水南", 25},
		{"三水南", "佛山西", 18},
		{"佛山西", "广州南", 33},

		{"深圳北", "深圳坪山", 36},
		{"深圳坪山", "惠州南", 20},
		{"惠州南", "惠东", 32},
		{"惠东", "鲘门", 35},
		{"鲘门", "汕尾", 33},
		{"汕尾", "陆丰", 35},
		{"陆丰", "葵潭", 30},
		{"葵潭", "普宁", 31},
		{"普宁", "潮阳", 27},
		{"潮阳", "潮汕", 26},
		{"潮汕", "饶平", 41},
	};

	CreateMap(M, places, PLACESNUM, ways, WAYNUM);
}