#include "Map.h"
#include "Order.h"
#include "Rail.h"
#include "Route.h"
#include "User.h"

int main() {
	/*scanf_s("%s", s, sizeof(String));
	gets_s(s, sizeof(String));*/
	char a, b;
	printf("input a:");
	scanf_s("%c", &a, 2);
	char a, b;
	printf("input a:");
	scanf_s("%c", &a, 2);
	while (getchar() != '\n') {
		while (getchar() != '\n') {
			getchar();
		}
		printf("请重新输入：");
		scanf_s("%c", &a, 2);
	}
	printf("%c\n", a);
	printf("input b:");
	scanf_s("%c", &b, 2);
	printf("%c\n", b);
	return 0;
}

void CreateRailMap() {
	String places[50] = {
		// 京广
		"乐昌东", "韶关", "英德西", "清远", "广州北", "广州南",
		// 广深港
		/*"广州南",*/ "庆盛", "虎门", "深圳北", "福田", "香港西九龙",
        // 贵广
		"怀集", "广宁", "肇庆东", "三水南", "佛山西", /*"广州南",*/
		// 南广
		"郁南", "南江口", "云浮东", /*"肇庆东",*/ /*"三水南",*/ /*"佛山西",*/ /*"广州南",*/
		// 杭深
		/*"深圳北",*/ "深圳坪山", "惠州南", "惠东", "鲘门", "汕尾", "陆丰", "葵潭", "普宁", "潮阳", "潮汕", "汕头", "饶平",
		// 梅汕
		"梅州西", "俞江北", "建桥", "丰顺东", "揭阳", "揭阳机场", /*"潮汕",*/
		// 江湛
		"湛江西", "吴川", "茂名", "电白", "马踏", "阳西", "阳江", "阳东", "恩平", "开平南", "台山", "双水镇", "新会"
	};

	WayInfo ways[100] = {
		{"乐昌东", "韶关", 100},

		{"广州南", "庆盛", 100},
		{"庆盛", "虎门", 100},
		{"虎门", "深圳北", 100},
		{"深圳北", "福田", 100},
		{"福田", "香港西九龙", 100},

		{"怀集", "广宁", 100},

		{"郁南", "南江口", 100},

		{"深圳北", "深圳坪山", 100},
		{"深圳坪山", "惠州南", 100},
	};
}